{
  "home": "Page d'accueil",
  "features": "Fonctionnalités",
  "commands": "Commandes",
  "dashboard": "Tableau de bord",
  "login": "Connexion",
  "logout": "Déconnexion",

  "add": "Inviter Yuuna",

  "english": "Anglais",
  "french": "Français",

  "github_bot": "Dépôt GitHub du bot",
  "github_website": "Dépôt GitHub du site",

  "home_title": "Yuuna - Page d'accueil",
  "home_center_text": "Un bot discord polyvalent",

  "page.top": "Haut de la page",

  "features.config": "Configuration",
  "features.XP": "Système d'XP",
  "features.bank": "Système de banque",
  "features.games": "Jeux",
  "features.moderation": "Modération",

  "features_title": "Yuuna - Fonctionnalités",
  "features_intro": "Yuuna est dotée de plusieurs fonctionnalités qui seront détaillées ici. Cette page ne sert qu'à expliquer ce que Yuuna peut faire, pas comment le faire. Pour voir une liste des différentes commandes, veuillez vous referer à la page ",
  "features_intro_link": "commandes",
  "features_intro_2": ". Vous pouvez tout configurer via les commandes, mais vous pouvez aussi le faire depuis la page ",
  "features_intro_link_2": "tableau de bord",

  "features_h_conf": "La configuration du bot",
  "features_h2_prefix": "Le préfixe",
  "features_p_conf_prefix_1": "Vous pouvez changer le préfixe des commandes, le préfixe par défaut étant ",
  "features_p_conf_prefix_2": ", vous pouvez par exemple mettre ",
  "features_p_conf_prefix_3": ". Vous devrez alors utiliser par exemple ",
  "features_p_conf_prefix_4": " au lieu de ",
  "features_p_conf_prefix_5": " pour faire apparaître la page d'aide.",

  "features_h2_language": "La langue",
  "features_p_conf_language_1": "Yuuna parle actuellement deux langages: anglais et français. Par défaut, elle parle en anglais, mais vous pouvez changer cela quand vous le voulez. Si vous connaissez un autre langage et souhaitez l'apprendre à Yuuna, n'hésitez pas à contacter le développeur ",
  "features_p_conf_language_2": " sur Discord.",

  "features_h2_disable": "Désactiver certaines commandes",
  "features_p_conf_disable_1": "Vous pouvez désactiver certaines commandes si vous ne souhaitez pas qu'elles soient utilisables sur votre serveur. Notez que vous ne pouvez désactiver que les commandes de cette façons. Par exemple, même si les commandes de banque sont désactivées, vous gagnerez quand même des Coins quand vous monterez de niveau, vous ne pourrez juste plus les voir (les systèmes d'XP et de banque seront détaillés juste après). Vous ne pouvez pas désactiver les sous-commandes d'un module, ce qui signifie par exemple que vous ne pouvez pas désactiver la possibilité de donner des Coins sans désactiver toute les commandes relatives à la banque.",

  "features_h2_autorole": "Le rôle automatique",
  "features_p_conf_autorole_1": "Vous pouvez configurer un rôle pour qu'il soit automatiquement donné à quiconque rejoint le serveur.",

  "features_h2_bot_master": "Le rôle maître du bot",
  "features_p_conf_bot_master": "Vous pouvez configurer un rôle pour qu'il soit maître du bot. Un membre qui possède ce rôle passera outre les vérifications de permissions de Yuuna, ils pourront donc utiliser toutes les commandes, à l'exception des commandes de modération.",

  "features_h_xp": "Le système d'XP",
  "features_h2_xp": "Comment ça marche",
  "features_p_xp_how_1": "Si le système d'XP est activé, quand vous envoyez un message dans un salon non-banni (voir plus bas), vous gagnez entre 10 et 20 points d'expérience. Pour empêcher le spam, vous ne pouvez gagner des points qu'une fois par minute. Quand vous atteignez un certain nombre de points d'XP, vous montez de niveau et gagnez 50 Coins (voir plus bas). Vous pouvez aussi configurer des rôles comme récompense : Quand un membre atteint un certain niveau, il obtient un rôle en récompense. Il est aussi possible d'obtenir un classement des membres du serveur par leurs points d'expérience.",
  "features_h2_conf": "La configuration",
  "features_p_xp_conf_1": "Vous pouvez bannir certains salons ou certains rôles; si un membre parle dans un salon banni, ou s'il possède un rôle banni, il ne gagnera pas d'expérience. Vous pouvez aussi changer le message de changement de niveau, le message par défaut étant : ",
  "features_p_xp_conf_2": "@membre, vous êtes maintenant niveau X.",
  "features_p_xp_conf_3": "Vous pouvez aussi choisir si vous voulez que le message de changement de niveau soit affiché ou pas, ou si vous voulez qu'il soit envoyé en privé ou non. Vous pouvez changer le délai de l'anti-spam, ou encore le nombre de Coins gagnés en montant de niveau. Le système d'XP est désactivé par défaut, and le message de changement de niveau est activé par défaut. Aucun salon n'est banni par défaut.",

  "features_h_bank": "La banque",
  "features_h2_bank": "Comment obtenir de l'argent ?",
  "features_p_bank_1": "Vous pouvez gagner de l'argent en montant de niveau avec le système d'XP: vous gagnez 50 Coins par niveau. Les modérateurs du serveur peuvent aussi directement modifier votre compte en vous donnant ou vous prenant des Coins. Comme pour le système d'XP, on peut obtenir un classement des membres les plus riches du serveur.",
  "features_h2_shop": "À quoi sert l'argent ?",
  "features_p_shop_1": "Vous pouvez garder votre argent pour vous vanter, mais l'utilisation principale des Coins est la boutique : Vous pouvez mettre en place une boutique pour que vos membres y achètent des rôles : Autant de rôles que vous le voulez, aussi chers que vous le voulez.",

  "features_h_games": "Les jeux",
  "features_p_games_1": "Vous pouvez jouer à quelques jeux avec Yuuna : Black Jack, Échecs, Morpion et Puissance 4. À l'exception des échecs, tous les jeux se jouent avec le système de réactions au lieu du chat. Une partie d'échecs sera annulée après 5 minutes d'inactivité, une partie d'un autre jeu sera annulée après 2 minutes d'inactivité. Yuuna peut gérer une partie d'un jeu par salon, si vous voulez par exemple faire deux parties de Black Jack en même temps, vous devez utiliser deux salons différents. Cependant, vous pouvez par exemple jouer une partie de Black Jack et une partie de Puissance 4 en même temps dans le même salon.",

  "features_h_moderation": "Les commandes de modération",
  "features_p_moderation_1": "Yuuna peut rendre muet, expulser ou bannir les méchants, pour peu que les commandes soient exécutées par un modérateur. Elle peut également purger des messages pour vous.",

  "commands_title": "Yuuna - Commandes",
  "commands_intro": "Cette page liste toutes les commandes que vous pouvez utiliser avec Yuuna, comment les utiliser et de quelles permissions vous et le bot avez besoin. Pour avoir une explication détaillée sur le fonctionnement des modules, veuillez vous referer à la page ",
  "commands_intro_link": "fonctionnalités",
  "commands_intro_2": ". Vous pouvez tout configurer via les commandes, mais vous pouvez aussi le faire depuis la page ",
  "commands_intro_link_2": "tableau de bord",
  "commands_intro_3": ". Ici, les crochets ( [] ) doivent être remplacés par une variable (souvent un nombre). Les arobases ( @ ) signifient que vous devez mentionner un membre et les dièses ( # ) signifient que vous devez mentionner un salon. Yuuna a besoin des permissions 'gérer les messages', 'gérer les rôles' et 'gérer les salons' pour fonctionner correctement. Pour les commandes de modération, Yuuna a également besoin des permissions 'expulser et bannir les membres'.",

  "commands_perm": "Permission requise",

  "commands_all": "Tout",
  "commands_staff": "Staff",
  "commands_non-staff": "Non staff",
  "commands_misc": "Divers",
  "commands_conf": "Configuration",
  "commands_xp": "Système d'XP",
  "commands_bank": "Magasin et boutique",
  "commands_games": "Jeux",
  "commands_mod": "Modération",

  "dashboard_title": "Yuuna - Tableau de bord",
  "dashboard_no-guild": "Désolé, il semble que vous n'ayez aucun serveur dans lequel vous avez suffisamment de permissions pour y configurer Yuuna :c",
  "dashboard_no-guild_2": "Vous avez besoin de la permission ",
  "dashboard_no-guild_3": "gérer le serveur",
  "dashboard_no-guild_4": " pour avoir accès au tableau de bord du serveur",

  "form.prefix": "Préfixe",
  "form.language": "La langue du bot",
  "form.english": "Anglais",
  "form.french": "Français",
  "form.disable": "Désactiver les commands",
  "form.autorole": "Rôle automatique",
  "form.none": "Aucun",
  "form.bot_master": "Rôle maître du bot",
  "form.confirm": "Yuuna doit-elle demander une confirmation pour les commandes risquées ?",
  "form.levels": "Le système d'XP",
  "form.ban_channels": "Salons bannis du système d'XP",
  "form.ban_roles": "Rôles bannis du système d'XP",
  "form.level_up_message": "Message de montée de niveau",
  "level_up_default_message": "{player}, vous êtes maintenant niveau {level}.",
  "form.message_disabled": "Désactiver le message de montée de niveau",
  "form.message_private": "Yuuna envoie le message de montée de niveau en message privé",
  "form.antispam": "Anti-spam du système d'XP (en secondes)",
  "form.bankreward": "Coins gagnés en montant de niveau",
  "form.role_reward.role": "Rôle récompense",
  "form.role_reward.level": "Niveau",
  "form.add": "Ajouter",

  "form.submit": "Sauvegarder",

  "source_code": "Le code source",
  "uses": "Utilise"
}
